###################################################################

# Created by write_sdc on Mon Feb 22 17:59:22 2021

###################################################################
set sdc_version 2.0

set_units -time ns -resistance 1.000000e+04kOhm -capacitance 1.000000e-04pF    \
-voltage V -current uA
set_load -pin_load 0 [get_ports ram_req]
set_load -pin_load 0 [get_ports {ram_adr[31]}]
set_load -pin_load 0 [get_ports {ram_adr[30]}]
set_load -pin_load 0 [get_ports {ram_adr[29]}]
set_load -pin_load 0 [get_ports {ram_adr[28]}]
set_load -pin_load 0 [get_ports {ram_adr[27]}]
set_load -pin_load 0 [get_ports {ram_adr[26]}]
set_load -pin_load 0 [get_ports {ram_adr[25]}]
set_load -pin_load 0 [get_ports {ram_adr[24]}]
set_load -pin_load 0 [get_ports {ram_adr[23]}]
set_load -pin_load 0 [get_ports {ram_adr[22]}]
set_load -pin_load 0 [get_ports {ram_adr[21]}]
set_load -pin_load 0 [get_ports {ram_adr[20]}]
set_load -pin_load 0 [get_ports {ram_adr[19]}]
set_load -pin_load 0 [get_ports {ram_adr[18]}]
set_load -pin_load 0 [get_ports {ram_adr[17]}]
set_load -pin_load 0 [get_ports {ram_adr[16]}]
set_load -pin_load 0 [get_ports {ram_adr[15]}]
set_load -pin_load 0 [get_ports {ram_adr[14]}]
set_load -pin_load 0 [get_ports {ram_adr[13]}]
set_load -pin_load 0 [get_ports {ram_adr[12]}]
set_load -pin_load 0 [get_ports {ram_adr[11]}]
set_load -pin_load 0 [get_ports {ram_adr[10]}]
set_load -pin_load 0 [get_ports {ram_adr[9]}]
set_load -pin_load 0 [get_ports {ram_adr[8]}]
set_load -pin_load 0 [get_ports {ram_adr[7]}]
set_load -pin_load 0 [get_ports {ram_adr[6]}]
set_load -pin_load 0 [get_ports {ram_adr[5]}]
set_load -pin_load 0 [get_ports {ram_adr[4]}]
set_load -pin_load 0 [get_ports {ram_adr[3]}]
set_load -pin_load 0 [get_ports {ram_adr[2]}]
set_load -pin_load 0 [get_ports {ram_adr[1]}]
set_load -pin_load 0 [get_ports {ram_adr[0]}]
set_load -pin_load 0 [get_ports ram_r_w]
set_load -pin_load 0 [get_ports {ram_data[31]}]
set_load -pin_load 0 [get_ports {ram_data[30]}]
set_load -pin_load 0 [get_ports {ram_data[29]}]
set_load -pin_load 0 [get_ports {ram_data[28]}]
set_load -pin_load 0 [get_ports {ram_data[27]}]
set_load -pin_load 0 [get_ports {ram_data[26]}]
set_load -pin_load 0 [get_ports {ram_data[25]}]
set_load -pin_load 0 [get_ports {ram_data[24]}]
set_load -pin_load 0 [get_ports {ram_data[23]}]
set_load -pin_load 0 [get_ports {ram_data[22]}]
set_load -pin_load 0 [get_ports {ram_data[21]}]
set_load -pin_load 0 [get_ports {ram_data[20]}]
set_load -pin_load 0 [get_ports {ram_data[19]}]
set_load -pin_load 0 [get_ports {ram_data[18]}]
set_load -pin_load 0 [get_ports {ram_data[17]}]
set_load -pin_load 0 [get_ports {ram_data[16]}]
set_load -pin_load 0 [get_ports {ram_data[15]}]
set_load -pin_load 0 [get_ports {ram_data[14]}]
set_load -pin_load 0 [get_ports {ram_data[13]}]
set_load -pin_load 0 [get_ports {ram_data[12]}]
set_load -pin_load 0 [get_ports {ram_data[11]}]
set_load -pin_load 0 [get_ports {ram_data[10]}]
set_load -pin_load 0 [get_ports {ram_data[9]}]
set_load -pin_load 0 [get_ports {ram_data[8]}]
set_load -pin_load 0 [get_ports {ram_data[7]}]
set_load -pin_load 0 [get_ports {ram_data[6]}]
set_load -pin_load 0 [get_ports {ram_data[5]}]
set_load -pin_load 0 [get_ports {ram_data[4]}]
set_load -pin_load 0 [get_ports {ram_data[3]}]
set_load -pin_load 0 [get_ports {ram_data[2]}]
set_load -pin_load 0 [get_ports {ram_data[1]}]
set_load -pin_load 0 [get_ports {ram_data[0]}]
set_load -pin_load 0 [get_ports ram_req2]
set_load -pin_load 0 [get_ports {ram_adr2[31]}]
set_load -pin_load 0 [get_ports {ram_adr2[30]}]
set_load -pin_load 0 [get_ports {ram_adr2[29]}]
set_load -pin_load 0 [get_ports {ram_adr2[28]}]
set_load -pin_load 0 [get_ports {ram_adr2[27]}]
set_load -pin_load 0 [get_ports {ram_adr2[26]}]
set_load -pin_load 0 [get_ports {ram_adr2[25]}]
set_load -pin_load 0 [get_ports {ram_adr2[24]}]
set_load -pin_load 0 [get_ports {ram_adr2[23]}]
set_load -pin_load 0 [get_ports {ram_adr2[22]}]
set_load -pin_load 0 [get_ports {ram_adr2[21]}]
set_load -pin_load 0 [get_ports {ram_adr2[20]}]
set_load -pin_load 0 [get_ports {ram_adr2[19]}]
set_load -pin_load 0 [get_ports {ram_adr2[18]}]
set_load -pin_load 0 [get_ports {ram_adr2[17]}]
set_load -pin_load 0 [get_ports {ram_adr2[16]}]
set_load -pin_load 0 [get_ports {ram_adr2[15]}]
set_load -pin_load 0 [get_ports {ram_adr2[14]}]
set_load -pin_load 0 [get_ports {ram_adr2[13]}]
set_load -pin_load 0 [get_ports {ram_adr2[12]}]
set_load -pin_load 0 [get_ports {ram_adr2[11]}]
set_load -pin_load 0 [get_ports {ram_adr2[10]}]
set_load -pin_load 0 [get_ports {ram_adr2[9]}]
set_load -pin_load 0 [get_ports {ram_adr2[8]}]
set_load -pin_load 0 [get_ports {ram_adr2[7]}]
set_load -pin_load 0 [get_ports {ram_adr2[6]}]
set_load -pin_load 0 [get_ports {ram_adr2[5]}]
set_load -pin_load 0 [get_ports {ram_adr2[4]}]
set_load -pin_load 0 [get_ports {ram_adr2[3]}]
set_load -pin_load 0 [get_ports {ram_adr2[2]}]
set_load -pin_load 0 [get_ports {ram_adr2[1]}]
set_load -pin_load 0 [get_ports {ram_adr2[0]}]
set_load -pin_load 0 [get_ports ram_r_w2]
set_load -pin_load 0 [get_ports {ram_data2[31]}]
set_load -pin_load 0 [get_ports {ram_data2[30]}]
set_load -pin_load 0 [get_ports {ram_data2[29]}]
set_load -pin_load 0 [get_ports {ram_data2[28]}]
set_load -pin_load 0 [get_ports {ram_data2[27]}]
set_load -pin_load 0 [get_ports {ram_data2[26]}]
set_load -pin_load 0 [get_ports {ram_data2[25]}]
set_load -pin_load 0 [get_ports {ram_data2[24]}]
set_load -pin_load 0 [get_ports {ram_data2[23]}]
set_load -pin_load 0 [get_ports {ram_data2[22]}]
set_load -pin_load 0 [get_ports {ram_data2[21]}]
set_load -pin_load 0 [get_ports {ram_data2[20]}]
set_load -pin_load 0 [get_ports {ram_data2[19]}]
set_load -pin_load 0 [get_ports {ram_data2[18]}]
set_load -pin_load 0 [get_ports {ram_data2[17]}]
set_load -pin_load 0 [get_ports {ram_data2[16]}]
set_load -pin_load 0 [get_ports {ram_data2[15]}]
set_load -pin_load 0 [get_ports {ram_data2[14]}]
set_load -pin_load 0 [get_ports {ram_data2[13]}]
set_load -pin_load 0 [get_ports {ram_data2[12]}]
set_load -pin_load 0 [get_ports {ram_data2[11]}]
set_load -pin_load 0 [get_ports {ram_data2[10]}]
set_load -pin_load 0 [get_ports {ram_data2[9]}]
set_load -pin_load 0 [get_ports {ram_data2[8]}]
set_load -pin_load 0 [get_ports {ram_data2[7]}]
set_load -pin_load 0 [get_ports {ram_data2[6]}]
set_load -pin_load 0 [get_ports {ram_data2[5]}]
set_load -pin_load 0 [get_ports {ram_data2[4]}]
set_load -pin_load 0 [get_ports {ram_data2[3]}]
set_load -pin_load 0 [get_ports {ram_data2[2]}]
set_load -pin_load 0 [get_ports {ram_data2[1]}]
set_load -pin_load 0 [get_ports {ram_data2[0]}]
create_clock [get_ports clock]  -period 5  -waveform {0 2.5}
set_clock_uncertainty 0.1  [get_clocks clock]
create_clock [get_ports clock2]  -period 5  -waveform {0 2.5}
set_clock_uncertainty 0.1  [get_clocks clock2]
group_path -name clock  -to [get_clocks clock]
set_input_delay -clock clock  0.2  [get_ports clock2]
set_input_delay -clock clock  0.2  [get_ports {ram_data[31]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[30]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[29]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[28]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[27]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[26]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[25]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[24]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[23]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[22]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[21]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[20]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[19]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[18]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[17]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[16]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[15]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[14]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[13]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[12]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[11]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[10]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[9]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[8]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[7]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[6]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[5]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[4]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[3]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[2]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[1]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data[0]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[31]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[30]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[29]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[28]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[27]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[26]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[25]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[24]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[23]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[22]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[21]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[20]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[19]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[18]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[17]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[16]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[15]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[14]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[13]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[12]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[11]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[10]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[9]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[8]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[7]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[6]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[5]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[4]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[3]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[2]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[1]}]
set_input_delay -clock clock  0.2  [get_ports {ram_data2[0]}]
set_input_delay -clock clock  0.2  [get_ports ram_ack]
set_input_delay -clock clock  0.2  [get_ports ram_ack2]
set_input_delay -clock clock  0.2  [get_ports it_mat]
set_output_delay -clock clock  0.1  [get_ports ram_req]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[31]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[30]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[29]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[28]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[27]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[26]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[25]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[24]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[23]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[22]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[21]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[20]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[19]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[18]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[17]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[16]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[15]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[14]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[13]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[12]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[11]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[10]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[9]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[8]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[7]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[6]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[5]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[4]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[3]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[2]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[1]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr[0]}]
set_output_delay -clock clock  0.1  [get_ports ram_r_w]
set_output_delay -clock clock  0.1  [get_ports {ram_data[31]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[30]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[29]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[28]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[27]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[26]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[25]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[24]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[23]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[22]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[21]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[20]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[19]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[18]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[17]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[16]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[15]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[14]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[13]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[12]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[11]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[10]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[9]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[8]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[7]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[6]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[5]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[4]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[3]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[2]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[1]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data[0]}]
set_output_delay -clock clock  0.1  [get_ports ram_req2]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[31]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[30]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[29]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[28]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[27]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[26]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[25]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[24]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[23]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[22]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[21]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[20]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[19]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[18]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[17]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[16]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[15]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[14]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[13]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[12]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[11]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[10]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[9]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[8]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[7]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[6]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[5]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[4]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[3]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[2]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[1]}]
set_output_delay -clock clock  0.1  [get_ports {ram_adr2[0]}]
set_output_delay -clock clock  0.1  [get_ports ram_r_w2]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[31]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[30]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[29]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[28]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[27]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[26]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[25]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[24]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[23]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[22]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[21]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[20]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[19]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[18]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[17]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[16]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[15]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[14]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[13]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[12]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[11]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[10]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[9]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[8]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[7]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[6]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[5]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[4]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[3]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[2]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[1]}]
set_output_delay -clock clock  0.1  [get_ports {ram_data2[0]}]
